[{"model": "curriculo.curso", "pk": 1, "fields": {"nome": "Análise e Desenvolvimento de Sistemas", "sigla": "ADS"}}, {"model": "curriculo.curso", "pk": 2, "fields": {"nome": "Banco de Dados", "sigla": "BD"}}, {"model": "curriculo.curso", "pk": 3, "fields": {"nome": "Gestão em Tecnologia da Informação", "sigla": "GTI"}}, {"model": "curriculo.curso", "pk": 4, "fields": {"nome": "Sistemas da Informação", "sigla": "SI"}}, {"model": "curriculo.disciplina", "pk": 1, "fields": {"nome": "Tecnologias Web", "data": "2019-02-19", "status": "ABERTA", "plano_ensino": "Aulas expositivas utilizando projetor, lousa eletrônica e computador nas quais se apresenta e discute os tópicos da disciplina, bem como trabalhos em grupo com apresentação escrita e defesa oral, apresentação de vídeos.\r\nCada período de aula de 50 minutos será completado com atividades a serem realizadas via ambiente virtual para um tempo de 10 minutos.\r\nAtividades contínuas (AC) semanais para acompanhamento do processo ensino aprendizagem.", "carga_horaria": 80, "competencias": "Desenvolver aplicações web para automação de processos de negócio utilizando bancos de dados relacionais.", "habilidades": "Conhecer e dominar as principais etapas de construção e publicação de um site para a web.\r\nDesenvolver sistemas web utilizando HTML/CSS, JavaScript, Node JS e Frameworks Python .\r\nConhecer a arquitetura de sistemas web dinâmicas.\r\nConhecer os conceitos de desenvolvimento de sistemas dinâmicos para a Internet, aplicando as mais recentes tecnologias e métodos para esta área.", "ementa": "Disciplina anterior: Linguagem de Programação I, Lógica de Programação\r\nDisciplina paralelo: Engenharia de Software, Linguagem de Programação II, Linguagem SQL, Ambiente de Desenvolvimento e Operações\r\nDisciplina posterior: Engenharia de Requisitos; Análise e Modelagem de Sistemas;", "conteudo_programatico": "Conceitos e fundamentos: Internet, Intranet e Extranet.\r\nArquitetura Cliente-Servidor e o Desenvolvimento de aplicações WEB Padrões Web.\r\nHTML (HyperText Markup Language) e CSS ( Cascading Style Sheets).\r\nEntender a sintaxe e comandos JavaScript e sua integração com HTML.\r\nNoções de NodeJS: sintaxes e comandos, funcionamento, arquitetura e sua instalação no Apache.\r\nPython e Django: Sintaxes, funcionamento, padrão MTV (Model-Template-View, ou Modelo-Template-Visão) e conexões com Banco de Dados", "bibliografia_basica": "DUCKETT, J. Javascript e Jquery. Desenvolvimento de Interfaces Web Interativas. 1a.ed. Rio de Janeiro: Altabooks, 2016.\r\nELMAN, J.;LAVIN, M. Django Essencial - Usando REST, websockets e Backbone. 1.ed. São Paulo: Novatec, 2015.\r\nFREEMAN, E.; FREEMAN, E. Use a cabeça! HTML com CSS e XHTML. Rio de Janeiro: Alta Books, 2ª. Edição, 2015.", "bibliografia_complementar": "ALMEIDA, F. Mean Full stack JavaScript para aplicações web com MongoDB, Express, Angular e Node. 1.ed. São Paulo: Casa do Código, 2015.\r\nHOLMES, S. MEAN Definitivo com Mongo, Express, Angular e Node. 1.ed. São Paulo: Novatec, 2016.\r\nMEJIA, A. Construindo uma Aplicação E-commerce com MEAN. 1.ed. São Paulo: Novatec, 2016.\r\nMORAES, W.B.. Construindo aplicações com NodeJS. 1.ed. São Paulo: Novatec, 2015.\r\nWILLIAMSON, K.. Introdução ao AngularJS: um guia para o desenvolvimento com o AngularJS. 1.ed", "percentual_pratico": 50, "percentual_teorico": 50, "coordenador": 102}}, {"model": "curriculo.disciplina", "pk": 2, "fields": {"nome": "Análise e Modelagem de Sistemas", "data": "2019-02-19", "status": "ABERTA", "plano_ensino": "Anteriores: Engenharia de Software.\r\nParalelas: Engenharia de Requisitos e Oficina de Projeto de Empresa 1 - OPE1.\r\nPosteriores: Qualidade de Software, Arquitetura e Projeto de Sistemas e Oficina de Projeto de\r\nEmpresa 2 - OPE2.", "carga_horaria": 80, "competencias": "Capacidade de especificar integralmente o comportamento do sistema de software a ser\r\ndesenvolvido através do documento denominado SRS (Software Requirements Specification);\r\nCapacidade de avaliar documentos SRS para garantir a qualidade da especificação e a\r\naderência ao software implementado;\r\nCapacidade de desenvolver o projeto de conclusão de curso.", "habilidades": "Definir o que é a UML e sua aplicação na modelagem de sistemas orientados a objetos;\r\nDerivar casos de uso a partir dos requisitos de sistema;\r\nIdentificar os cenários que compõem um caso de uso;\r\nDetalhar os cenários através da descrição de diálogos completos e coerentes entre o ator e sistema;\r\nA partir do contexto fornecido pela descrição dos cenários dos casos de uso, derivar e manter a\r\nrastreabilidade entre os seguintes artefatos: Wireframes, Dicionários de Dados, Requisitos de\r\nSoftware", "ementa": "Aulas expositivas nas quais serão apresentados e discutidos os tópicos da disciplina.\r\nDesenvolvimento de atividades práticas com estratégias diversas, individuais ou em equipes, para\r\nmelhor sedimentação dos conteúdos abordados.\r\nEntre os recursos disponíveis estão: projetor multimídia, lousa eletrônica, acesso à Internet e\r\nlaboratório de informática, conforme as especificidades da disciplina.\r\nAtividades contínuas (AC) diárias para acompanhamento do processo de aprendizagem, sendo\r\nnecessária", "conteudo_programatico": "Análise e Modelagem de Sistemas:\r\nContextualização: da Modelagem de Negócio à Especificação do Sistema;\r\nRequisitos de Sistemas x Casos de Uso x Requisitos de Software;\r\nIntrodução à UML.\r\nModelagem de Casos de Uso:\r\nO que os casos de uso são e o que não são: os motivos dos casos de uso serem tão mal\r\ncompreendidos;\r\nOrientações:\r\nEvitar “Tempo” como Ator;\r\nEvitar Casos de Uso CRUD (Create, Read, Update e Delete);\r\nExceção: Caso de Uso “Realizar Login”.", "bibliografia_basica": "BITTENER, K.; SPENCE, I.  Use Case Modeling. 1st ed. New York: Addison-Wesley, 2002.\r\nBLAHA, M.; RUMBAUGH, J. Modelagem e projetos baseados em objetos com UML 2. Rio de\r\nJaneiro:Elsevier­Campus, 2006.\r\nEVANS, E. Domain-Driven Design: Tackling Complexity in the Heart of Software. Addison-Wesley,\r\nUpper Saddle River, NJ, USA. 20 ago. 2003. 560p. ISBN: 0-321-12521-5.", "bibliografia_complementar": "GAMMA; H.; Johson; V. Padrões de Projeto. Porto Alegre: Bookman, 2005.\r\nLARMAN, C. Utilizando UML e Padrões: uma introdução à análise e ao projeto orientados a objetos\r\ne ao desenvolvimento iterativo. 3.ed. Porto Alegre: Bookman, 2007.\r\nGUEDES, Gilleanes T. A.: UML 2 - Uma abordagem prática. 2 ed. São Paulo: Novatec Editora, 2011.\r\nRUMBAUGH, J.; JACOBSON, I; BOOCH, G. The Unified Modeling Language Reference Manual.\r\n2 nd ed. New York: Addison-Wesley, 2004.", "percentual_pratico": 60, "percentual_teorico": 40, "coordenador": 103}}, {"model": "curriculo.disciplina", "pk": 3, "fields": {"nome": "Lógica de Programação", "data": "2019-02-19", "status": "ABERTA", "plano_ensino": "Introdução: Lógica. Algoritmos.\r\nTipos de Dados: Constantes. Variáveis. Instruções básicas. Operadores aritméticos, lógicos e relacionais\r\nEstruturas lógicas ou de controle de fluxo:\r\nEstruturas sequências\r\nEstruturas condicionais ou de seleção: Simples. Composta. Encadeada ou Aninhada.\r\nEstruturas de repetição ou laço: laço indefinido, laço definido e laço aninhados.\r\nFunções: Definição e Vantagens. Escopo dos Dados e do Código. Parâmetro de Entrada e Saída. Tipos\r\nde funções: com retorno", "carga_horaria": 80, "competencias": "Desenvolver raciocínio lógico para organizar os elementos necessários para a resolução de um\r\nproblema utilizando as ferramentas básicas de lógica de programação\r\nCriar uma base sólida em lógica de programação\r\nDesenvolver algoritmos usando funções e refinamentos sucessivos.\r\nUtilizar estruturas de dados na resolução de problemas computacionais.", "habilidades": "Introduzir à lógica de programação de computadores\r\nConhecer e dominar as estruturas básicas de controle de fluxo\r\nDesenvolver a técnica de refinamentos sucessivos na solução de problemas, aprendendo a decompor\r\num problema em sub-tarefas ou módulos\r\nUtilizar as estruturas de dados homogêneas: vetores e matrizes\r\nImplementar soluções algorítmicas através da linguagem Python", "ementa": "Anteriores: Nenhuma\r\nParalelas: Linguagem de Programação I\r\nPosteriores: Linguagem de Programação II", "conteudo_programatico": "Introdução: Lógica. Algoritmos.\r\nTipos de Dados: Constantes. Variáveis. Instruções básicas. Operadores aritméticos, lógicos e relacionais\r\nEstruturas lógicas ou de controle de fluxo:\r\nEstruturas sequências\r\nEstruturas condicionais ou de seleção: Simples. Composta. Encadeada ou Aninhada.\r\nEstruturas de repetição ou laço: laço indefinido, laço definido e laço aninhados.\r\nFunções: Definição e Vantagens. Escopo dos Dados e do Código. Parâmetro de Entrada e Saída. Tipos\r\nde funções: com retorno", "bibliografia_basica": "DIERBACH, C. Introduction to Computer Science Using Python: A Computational Problem-\r\nSolving Focus 1st Edition, New York: Wiley, 2012.\r\nMENEZES, N.N.C. Introdução à Programação com Python: algoritmos e lógica de programação\r\npara iniciantes. 2 a . ed. São Paulo: Novatec, 2014.\r\nZELLE J. Python Programming: An Introduction to Computer Science, 3 rd Ed. Sherwood: Franklin,\r\nBeedle &amp; Associates Inc.;", "bibliografia_complementar": "CARVALHO, A.P.L.F.; LORENA, A.C. Introdução à computação: software, hardware e dados. 1a.\r\ned. Rio de Janeiro: LTC, 2017.\r\nFARRELL, J. Lógica e Design de Programação – Introdução. 1. ed. São Paulo: Cengage Learning,\r\n2010.\r\nLOPES, A.; GARCIA, G. Introdução à Programação: 500 Algoritmos. Rio de Janeiro: Elsevier,\r\n2002.\r\nLUTZ, M. Learning Python. 5 th . Ed. Sebastopol: O&#39;Reilly Media, 2013.\r\nMOKARZEL, F. C.; SOMA, N. Y. Introdução à Ciência da Computação. Rio de Janeiro: Elsevier,\r\n2008.", "percentual_pratico": 0, "percentual_teorico": 100, "coordenador": 104}}, {"model": "curriculo.disciplina", "pk": 4, "fields": {"nome": "Desenvolvimento para Dispositivos Móveis", "data": "2019-02-19", "status": "ABERTA", "plano_ensino": "Aulas expositivas utilizando projetor, lousa eletrônica e computador nas quais se apresenta e discute os\r\ntópicos da disciplina, bem como trabalhos em grupo com apresentação escrita e defesa oral,\r\napresentação de vídeos.\r\nCada período de aula de 50 minutos será completado com atividades a serem realizadas no ambiente de", "carga_horaria": 80, "competencias": "Entender os modelos de programação para dispositivos móveis: nativo, web e híbrido\r\nConhecer as tecnologias disponíveis para desenvolvimento de dispositivos móveis\r\nConhecer os conceitos fundamentais e a arquitetura para desenvolvimento de aplicações para\r\nAndroid\r\nConhecer os recursos tecnológicos disponíveis na plataforma Android (Android SDK)\r\nEntender o funcionamento de um aplicativo móvel\r\nConhecer as formas de armazenamento de dados e comunicação com internet, serviços e APIs em\r\naplica", "habilidades": "Desenvolver aplicativos móveis utilizando a plataforma Android\r\nUtilizar linguagem de programação Kotlin para desenvolver aplicativos móveis para Android\r\nUtilizar os recursos tecnológicos disponíveis na plataforma Android (Android SDK)\r\nDesenvolver aplicações para dispositivos móveis utilizando os diversos componentes visuais\r\nDesenvolver aplicações para Android utilizando armazenamento de dados\r\nDesenvolver aplicações para Android que consomem serviços na web e utilizam APIs", "ementa": "Linguagem de Programação ||, Tecnologias Web, Banco de Dados, Desenvolvimento de Aplicações\r\nDistribuídas", "conteudo_programatico": "Conceitos fundamentais, modelos de desenvolvimento de aplicativos móveis e tecnologias (Kotlin,\r\nAndroid, aplicativos nativos, web e híbridos)\r\nDesenvolvimento de aplicativos móveis com Android\r\nActivity e Intent\r\nInterfaces gráficas - Layout e Views, Action Ba, Navigation Drawer e Listas\r\nNavegação e envio de parâmetros entre telas\r\nNotificações e push de mensagens\r\nPersistência em bancos de dados locais\r\nConsumo de serviços web e APIs", "bibliografia_basica": "LECHETA, R. R. Android Essencial com Kotlin. Edição: 1ª ed. Novatec, 2017.\r\nLECHETA, R. R. Google Android: aprenda a criar aplicações para dispositivos móveis com o Android\r\nSDK. 5.ed. São Paulo: Novatec, 2010.\r\nFIRTMAN, M. Programming the Mobile Web. 1st ed. Sebastopol: O´Reilly, 2010.", "bibliografia_complementar": "STARK, J.. Building Android Apps with HTML, CSS, and JavaScript. 1st ed. Sebastopol: O´Reilly,\r\n2010.\r\nSILVA, M.S. jQuery Mobile - Desenvolva Aplicações Web para Dispositivos Móveis com HTML5,\r\nCSS3, AJAX, jQuery e JQUERY UI. 1a ed. Novatec, 2011\r\nFLING, B.. Mobile Design and Development: practical concepts and techniques for creating mobile\r\nsites and web apps. 1st ed. Sebastopol: O´Reilly, 2009.\r\nSTARK, J.. Building iPhone Apps with HTML, CSS, and JavaScript. 1st ed. Sebastopol: O´Reilly,", "percentual_pratico": 50, "percentual_teorico": 50, "coordenador": 105}}]